<a href="https://colab.research.google.com/github/Charee-Villapong/charee-villapong/blob/master/Machine_Learning_Training.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Python（scikit-learn）による機械学習実装20問**

https://www.youtube.com/watch?v=Fbynk_9TfXg&t=782s

In [82]:
import pandas as pd

In [83]:
data = pd.read_csv("/content/drive/MyDrive/Machine Learning Training/data.csv のコピー")

In [84]:
data.head()

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0     NaN
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male

In [85]:
data.isnull()

      Name    Age    Sex
0    False  False  False
1    False  False  False
2    False  False   True
3    False  False  False
4    False  False  False
..     ...    ...    ...
886  False  False  False
887  False  False  False
888  False   True  False
889  False  False  False
890  False  False  False

[891 rows x 3 columns]

In [86]:
data.isnull().sum()

Name      0
Age     177
Sex      13
dtype: int64

In [87]:
data_dropna = data.dropna()

In [88]:
data.shape

(891, 3)

In [89]:
data_dropna.shape

(704, 3)

In [90]:
data["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [91]:
data.columns

Index(['Name', 'Age', 'Sex'], dtype='object')

In [109]:
mean = int(data[["Age"]].mean())
df_zero = data[["Age"]].fillna(mean)
df_zero.tail()

      Age
886  27.0
887  19.0
888  29.0
889  26.0
890  32.0

In [93]:
data.tail()

                                         Name   Age     Sex
886                     Montvila, Rev. Juozas  27.0    male
887              Graham, Miss. Margaret Edith  19.0  female
888  Johnston, Miss. Catherine Helen "Carrie"   NaN  female
889                     Behr, Mr. Karl Howell  26.0    male
890                       Dooley, Mr. Patrick  32.0    male

In [116]:
median = data[["Age"]].median()
df_median = data[["Age"]].fillna(median)
df_median.tail()

      Age
886  27.0
887  19.0
888  28.0
889  26.0
890  32.0

In [113]:
mean = data["Age"].mean()